tap 'caskroom/cask'
tap 'homebrew/core'
tap 'homebrew/emacs'
tap 'homebrew/fuse'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'railwaycat/emacsmacport'
cask 'osxfuse'

brew 'ack'
brew 'aspell'
brew 'bash-completion'
brew 'cask'
brew 'sphinx-doc'
brew 'cmake'
brew 'ninja'
brew 'openssl'
brew 'sqlite'
brew 'python'
brew 'clang-format'
brew 'editorconfig'
brew 'fasd'
brew 'flake8'
brew 'gdb'
brew 'git-flow'
brew 'global'
brew 'hunspell'
brew 'llvm'
brew 'markdown'
brew 'node'
brew 'python3'
brew 'rtags', restart_service: true
brew 'the_silver_searcher'
brew 'wget'
brew 'zsh'
brew 'homebrew/emacs/popup'
brew 'homebrew/emacs/auto-complete'
brew 'homebrew/emacs/tern', args: ['with-auto-complete']
brew 'homebrew/fuse/sshfs'
brew 'railwaycat/emacsmacport/emacs-mac', args: ['with-spacemacs-icon']
