tap "1password/tap"
tap "d12frosted/emacs-plus"
tap "homebrew/services"

brew "abseil"
brew "ack"
brew "arduino-cli"
brew "ast-grep"
brew "libunistring"
brew "bash"
brew "bash-completion"
brew "bat"
brew "c-ares"
brew "protobuf"
brew "grpc"
brew "bear"
brew "berkeley-db", link: true
brew "freetype"
brew "fontconfig"
brew "glib"
brew "chezmoi"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "cppcheck"
brew "difftastic"
brew "editorconfig"
brew "enchant"
brew "eza"
brew "fasd"
brew "fd"
brew "fish"
brew "sqlite"
brew "flake8"
brew "fribidi"
brew "fzf"
brew "gcc"
brew "libavif"
brew "gd"
brew "gh"
brew "harfbuzz"
brew "pango"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-flow"
brew "python@3.10"
brew "git-imerge"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "gpgme"
brew "lua"
brew "gnuplot"
brew "pkgconf"
brew "gobject-introspection"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "htop"
brew "hub"
brew "libheif"
brew "libraw"
brew "imagemagick"
brew "isort"
brew "isync"
brew "libgccjit"
brew "libuv"
brew "libvterm"
brew "llvm"
brew "luarocks"
brew "mailutils"
brew "markdown"
brew "marksman"
brew "minimal-racket"
brew "xapian"
brew "mu"
brew "tree-sitter"
brew "neovim"
brew "ninja"
brew "node"
brew "ollama", restart_service: :changed
brew "pandoc"
brew "pdf2svg"
brew "pipx"
brew "plantuml"
brew "platformio"
brew "pngpaste"
brew "pre-commit"
brew "prettier"
brew "python@3.9"
brew "qt@5"
brew "ripgrep"
brew "rust-analyzer"
brew "shellcheck"
brew "socat"
brew "sphinx-doc"
brew "starship"
brew "terminal-notifier"
brew "texlab"
brew "tldr"
brew "tmux"
brew "trash", link: true
brew "tree"
brew "uv"
brew "wget"
brew "xclip"
brew "zsh"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-savchenkovaleriy-big-sur-curvy-3d-icon", "with-xwidgets"]

cask "1password-cli"
cask "font-ibm-plex"
cask "font-inconsolata"
cask "font-inconsolata-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-juliamono"
cask "font-overpass"
cask "graphql-playground"
cask "mactex"
cask "neovide-app"
cask "wezterm"
