jorgebucaran/fisher
jethrokuan/z
mollifier/fish-cd-gitroot
nickeb96/puffer-fish
jorgebucaran/nvm.fish
patrickf1/fzf.fish
jorgebucaran/autopair.fish
pymander/vfish
wfxr/forgit
